Revit 2027 API
FamilyInstanceCreationData.Axis Property
 Get or set the axis of the FamilyInstance
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Line Axis { get; set; }
Public Property Axis As Line
	Get
	Set
public:
property Line^ Axis {
	Line^ get ();
	void set (Line^ value);
}
member Axis : Line with get, set
Property Value
Line
Remarks
 The element property will be the axis while performing the rotation.
See Also
Reference
FamilyInstanceCreationData Class
Autodesk.Revit.Creation Namespace